0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    out
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (1 0 0);
    }
    in
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sym1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sym2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
