system/fieldAverage.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type                fieldAverage;
functionObjectLibs  ("libfieldFunctionObjects.so");

//timeStart           150;
//timeEnd 200;
writeControl        writeTime;

// ************************************************************************* //
