system/graphUniform
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. A specified number of graph points are used, distributed
    uniformly along the line.

\*---------------------------------------------------------------------------*/

start           (5 -8 0);
end             (5 8 0);
nPoints         100;

fields          (UMean pMean kMean epsilonMean);

axis            y; // The independent variable of the graph. Can be "x",
                          // "y", "z", "xyz" (all coordinates written out), or
                          // "distance" (from the start point).

#includeEtc "caseDicts/postProcessing/graphs/graphUniform.cfg"

// ************************************************************************* //
