system/graphUniform.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

sets
(
    line
    {
        type            lineUniform;
        axis            $axis;
        start           $start;
        end             $end;
        nPoints         $nPoints;
    }
);

// ************************************************************************* //
